Revit 2027 API
RebarBendingDetailType.AngularDimensionsDisplayOption Property
 Identifies the angular dimensions display options.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public BendingDetailAngularDimensionsDisplayOptions AngularDimensionsDisplayOption { get; set; }
Public Property AngularDimensionsDisplayOption As BendingDetailAngularDimensionsDisplayOptions
	Get
	Set
public:
property BendingDetailAngularDimensionsDisplayOptions AngularDimensionsDisplayOption {
	BendingDetailAngularDimensionsDisplayOptions get ();
	void set (BendingDetailAngularDimensionsDisplayOptions value);
}
member AngularDimensionsDisplayOption : BendingDetailAngularDimensionsDisplayOptions with get, set
Property Value
BendingDetailAngularDimensionsDisplayOptions
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
RebarBendingDetailType Class
Autodesk.Revit.DB.Structure Namespace